In [1]:
import pandas as pd

In [5]:
pd.Series(['banana',42])

0    banana
1        42
dtype: object

In [6]:
# series 만들기
pd.Series(['banana',42],index = ['name','age'],name='kind')

name    banana
age         42
Name: kind, dtype: object

In [7]:
# 데이터 프레임 만들기

In [8]:
pd.DataFrame({
    'Name':['Framkin','Gosset'],
    'Born':['1920-07-05','1876-06-03'],
    'Age':[37,61]
})

      Name        Born  Age
0  Framkin  1920-07-05   37
1   Gosset  1876-06-03   61

In [9]:
# 리스트 안에 리스트가 하나의 행
# 딕셔너리는 원래 순서가x원래 지정한 순서대로 안만들어 질수 있다(orderdict로 순서 정렬가능)
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                   columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
df = pd.read_csv('data/scientists.csv')

In [4]:
#2023-4-6 시리즈 메서드 정리

In [5]:
df['Age'].mean()

59.125

In [6]:
# 숫자값에 한해서 나오고 글자값은 안나옴
df.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [7]:
# 중복값없는 시리즈 반환
df.drop_duplicates()

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [8]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [9]:
# 일치하는 중복값 제거하고 나옴
df.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [10]:
df.drop_duplicates(subset=['brand'])

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

In [11]:
# 위에꺼 다시 데이터 가져옴
df = pd.read_csv('data/scientists.csv')

In [12]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [13]:
# 정렬은 두가지 방법. index values
# values는 데이터값으로 정렬 이름 먼저 그다음 나이 순
# Axis 0은 왼쪽부터 오른쪽 순서를 의미
# ascendging false 이름 알바펫 순서 반대로 
df.sort_values(['Name','Age'],ascending=False)

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
5             John Snow  1813-03-15  1858-06-16   45           Physician
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [14]:
# df 찍어도 결과값은 변하지 않는다.(위에꺼랑 비교해서)
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [15]:
# 리턴값이 시리즈로 나온다
# to_frame() 데이터프레임으로 전환 가능
df['Age'].to_frame()

   Age
0   37
1   61
2   90
3   66
4   56
5   45
6   41
7   77

In [16]:
# 시리즈와 불린 추출 사용하기( =조건을 만족하는 데이터 뽑가)

In [17]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [18]:
# 과학자들의 평균 나이
df['Age'].mean()

59.125

In [19]:
# 평균나이보다 많은 과학자 데이터
df[df['Age'] >= df['Age'].mean()]       # True,False

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [20]:
# true만 데이터 선택 false 는 데이터 빠짐
df['Age'] >= df['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [21]:
cond1 = df['Age'] >= df['Age'].mean()

In [22]:
df[cond1]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [23]:
df[[True,False,True,False,True,False,True,False]]

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [24]:
df['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [25]:
df['Age'] + df['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [26]:
df['Age'] + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [27]:
# Nan? = > not a number 
df['Age'] + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [28]:
rev_age = df['Age'].sort_index(ascending=False)

In [29]:
rev_age

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [30]:
# 인덱스 같은 거것 끼리 더함
rev_age + df['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [31]:
# 시리즈와 데이터프레임의 데이터 처리하기

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [33]:
# 값을 문자열 표현으로 변환
# format 왜 쓰지? --> (문자열이 이렇게 생겼습니다 라고 변환시켜줄려고)
born_datetime = pd.to_datetime(df['Born'],format='%Y-%m-%d')

In [34]:
died_datetime = pd.to_datetime(df['Died'],format='%Y-%m-%d')

In [35]:
# 데이터 프레임에 컬럼(다른컬럼명 사용) 새로 만들고 삽입
df['born_dt'],df['died_dt'] = (born_datetime, died_datetime)

In [36]:
df['died_dt'] - df['born_dt']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [37]:
# format 없이 하면 안나옴 
pd.to_datetime('2023년 12월 8일',format='%Y년 %m월 %d일')

Timestamp('2023-12-08 00:00:00')

In [38]:
# drop 제거 Born axis=1 은 열을 의미
df.drop('Born',axis=1)

,Name,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [39]:
# 이렇게 쓰는게 안 헷갈림
df.drop(columns=['Died'],index=[3])

,Name,Born,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,90,Nurse,1820-05-12,1910-08-13
4,Rachel Carson,1907-05-27,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,77,Mathematician,1777-04-30,1855-02-23

In [40]:
# 1은 인덱스 axis=0 은 행을 제거
df.drop(1,axis=0)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [41]:
df.drop(columns=["Died"],index=[3])

,Name,Born,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,90,Nurse,1820-05-12,1910-08-13
4,Rachel Carson,1907-05-27,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,77,Mathematician,1777-04-30,1855-02-23

In [42]:
df.to_csv('test.csv')